import Header from "../scripts/header";
import Footer from "../scripts/footer";
import "../styles/services.css"

function AboutUs() {
    return(
        <div className="container">
            <Header/>
            <div className="main-serv">
                <h1>Про наш магазин</h1>
                <p>Ми пропонуємо широкий асортимент та чималу кількість оригінальних автомобільних запчастин та аксесуарів до автомобілів, а також виробів, випущених провідними світовими виробниками за ліцензією.</p>
                <p>Наші покупці за прийнятною ціною можуть замовити та отримати прямо додому (або в інше зручне для вас місце) запасну частину для свого авто.</p>
                <p>Для оптових покупців діє дисконтна програма.</p>
                <p>Дякуємо за відвідування нашого сайту, чекаємо на ваші листи на ел. пошту <a href="info@example.ua">info@example.ua</a> або дзвінків за телефоном <a href="380667943455">+380667943455</a>, <a href="380671390657">+380671390657</a>.</p>
            </div>
            <Footer/>
        </div>
    );
}

export default AboutUs;