import Header from "../scripts/header";
import Footer from "../scripts/footer";
import "../styles/services.css";

function Zgoda() {
    return(
        <div className="container">
            <Header/>
            <div className="main-serv">
                <h1>УГОДА КУПІВЛІ-ПРОДАЖУ АВТОМОБІЛЬНИХ ДЕТАЛЕЙ</h1>

                <p>Ця Угода укладається між:</p>

                <p><strong>Продавець:</strong>
                    (Повне ім'я або назва компанії Продавця)
                    (Поштова адреса Продавця)
                    (Контактні телефони Продавця)
                    (Електронна пошта Продавця)</p>

                <p><strong>та</strong></p>

                <p><strong>Покупець:</strong>
                    (Повне ім'я або назва компанії Покупця)
                    (Поштова адреса Покупця)
                    (Контактні телефони Покупця)
                    (Електронна пошта Покупця)</p>

                <ol>
                    <li>
                        <strong>Предмет угоди:</strong>
                        Продавець зобов'язується продати, а Покупець зобов'язується купити автомобільні деталі, зазначені у додатку до цієї Угоди.
                    </li>
                    <li>
                        <strong>Ціна та сплата:</strong>
                        <ol>
                            <li>2.1. Загальна вартість автомобільних деталей складає (сума в гривнях).</li>
                            <li>2.2. Покупець зобов'язується сплатити цю суму Продавцеві протягом (строк, наприклад, 14 днів) з моменту підписання цієї Угоди.</li>
                        </ol>
                    </li>
                    <li>
                        <strong>Передача власності:</strong>
                        Власність на автомобільні деталі переходить до Покупця з моменту повної оплати відповідно до пункту 2 цієї Угоди.
                    </li>
                    <li>
                        <strong>Стан автомобільних деталей:</strong>
                        <ol>
                            <li>4.1. Продавець гарантує, що автомобільні деталі відповідають опису, наданому у додатку до цієї Угоди.</li>
                            <li>4.2. Покупець має право перевірити стан автомобільних деталей до приймання їх у власність.</li>
                        </ol>
                    </li>
                    <li>
                        <strong>Відповідальність сторін:</strong>
                        Обидві сторони несуть відповідальність за порушення умов цієї Угоди відповідно до чинного законодавства.
                    </li>
                    <li>
                        <strong>Заключні положення:</strong>
                        <ol>
                            <li>6.1. Ця Угода є юридичною угодою між сторонами і регулює їхні взаємовідносини.</li>
                            <li>6.2. Зміни або доповнення до цієї Угоди мають чинність лише у випадку письмової згоди обох сторін.</li>
                        </ol>
                    </li>
                </ol>

                <p>Ця Угода укладена та підписана обома сторонами в ___________ (місце) ____________ (дата).</p>

                <p><strong>Підпис Продавця:</strong> ______________</p>
                <p>(Ім'я та підпис Продавця)</p>

                <p><strong>Підпис Покупця:</strong> _______________</p>
                <p>(Ім'я та підпис Покупця)</p>
            </div>
            <Footer/>
        </div>
    );
}

export default Zgoda;